#### Day 2: CREATE Statement and Basic SELECT Statements ðŸ“Š

Today we cover CREATE TABLE and basic SELECT queries.

#### 1. Database Connection

In [1]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="30_Days_SQL"
)
cursor = conn.cursor()
print("Connected to '30_Days_SQL'!")

Connected to '30_Days_SQL'!

#### 2. Practice Exercise 1: Create products table
**Structure:**
- product_id (INT PRIMARY KEY)
- product_name (VARCHAR(50), NOT NULL)
- category (VARCHAR(50))
- price (DECIMAL(10, 2))
- stock_quantity (INT)

In [2]:
cursor.execute("DROP TABLE IF EXISTS products")
cursor.execute('''
CREATE TABLE products (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(50) NOT NULL,
    category VARCHAR(50),
    price DECIMAL(10, 2),
    stock_quantity INT
)
''')

products_data = [
    (1, 'Laptop', 'Electronics', 1200.00, 10),
    (2, 'Mouse', 'Electronics', 25.00, 200),
    (3, 'Keyboard', 'Electronics', 45.00, 150),
    (4, 'Chair', 'Furniture', 150.00, 50),
    (5, 'Desk', 'Furniture', 300.00, 20),
    (6, 'Book', 'Education', 20.00, 500)
]
cursor.executemany("INSERT INTO products VALUES (%s, %s, %s, %s, %s)", products_data)
conn.commit()
print("Products table created and data inserted!")

Products table created and data inserted!

#### 3. Practice Exercise 2: Insert data into students table
First, we create the students table as defined in the common database.

In [ ]:
cursor.execute("DROP TABLE IF EXISTS students")
cursor.execute('''
CREATE TABLE students (
    student_id INT PRIMARY KEY,
    student_name VARCHAR(50) NOT NULL,
    class VARCHAR(10),
    course VARCHAR(50),
    score INT
);
''')

students_data = [
    (1, 'John', 'A', 'Math', 85),
    (2, 'Mary', 'A', 'Math', 90),
    (3, 'Jake', 'B', 'Science', 70),
    (4, 'Emily', 'B', 'Science', 75),
    (5, 'Steve', 'A', 'Math', 95),
    (6, 'John', 'A', 'Physics', 88)
]
cursor.executemany("INSERT INTO students VALUES (%s, %s, %s, %s, %s)", students_data)
conn.commit()
print("Data inserted into students table!")

#### 4. Practice Exercise 3: Retrieve name and department from employees
First, we create the departments and employees tables with sample data.

In [6]:
cursor.execute("SET FOREIGN_KEY_CHECKS=0")
cursor.execute("DROP TABLE IF EXISTS employees")
cursor.execute("DROP TABLE IF EXISTS departments")
cursor.execute("SET FOREIGN_KEY_CHECKS=1")

cursor.execute('''
CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    department_name VARCHAR(50)
)
''')

cursor.execute('''
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10,2),
    department_id INT,
    manager_id INT,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
)
''')

departments_data = [
    (1, 'IT'),
    (2, 'HR'),
    (3, 'Marketing'),
    (4, 'Finance')
]
cursor.executemany("INSERT INTO departments VALUES (%s, %s)", departments_data)

employees_data = [
    (1, 'Alan', 28, 60000, 1, None),
    (2, 'Brian', 35, 80000, 3, 1),
    (3, 'Catherine', 42, 90000, 2, 1),
    (4, 'Dylan', 25, 50000, 1, 2),
    (5, 'Evan', None, 70000, 4, 3),
    (6, 'Helen', 38, 95000, 3, 3)
]
cursor.executemany("INSERT INTO employees VALUES (%s, %s, %s, %s, %s, %s)", employees_data)
conn.commit()

query = """
SELECT name, 
       (SELECT department_name FROM departments d WHERE d.department_id = e.department_id) AS department 
FROM employees e
"""
df = pd.read_sql(query, conn)
df

#### 5. Practice Exercise 4: Retrieve all rows from students

In [7]:
query = "SELECT * FROM students"
df = pd.read_sql(query, conn)
df

In [8]:
conn.close()